Revit 2026 API

# LightDistributionStyle Enumeration

---

Tags for specific light distribution styles

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LightDistributionStyle
```
```vb
Public Enumeration LightDistributionStyle
```
```cpp
public enum class LightDistributionStyle
```
```fsharp
type LightDistributionStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Hemispherical | 1 | Hemispherical light distribution. |
| PhotometricWeb | 3 | Photometric web (IES) light distribution. |
| Spherical | 0 | Spherical light distribution. |
| Spot | 2 | Spot light distribution. |

#### Reference

Autodesk.Revit.DB.Lighting Namespace